IDEA Open Model
RebarGeneral Class
Compatible with IDEA StatiCa 20.1
 Represents a single main rebar in 3D space. Holds data from generated rebar or rebar imported from Tekla. the rebarShape is in global coordinates and it is not possible to prject it along Member1D, Polyline, ... (referenceLine)
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.RebarBase
 IdeaRS.OpenModel.Model.RebarGeneral
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class RebarGeneral : RebarBase
Public Class RebarGeneral
	Inherits RebarBase
The RebarGeneral type exposes the following members.
Constructors
Name | Description
RebarGeneral
 create a new instance.
Top
Properties
Name | Description
Diameter
 Gets or sets the Rebar Diameter.
 (Inherited from RebarBase.)
GroupId
 identity for group identification number
 (Inherited from RebarBase.)
Id
 Element Id
 (Inherited from OpenElementId.)
Material
 Gets or sets the reference of material properties.
 (Inherited from RebarBase.)
PlaneNormal
 Normal vector of the plane where the rebar lie. Used to deterine if this rebar is stirrup.
RebarAllocationElement
 the element where this rebar belongs (part of that beam)
 (Inherited from RebarBase.)
RebarParentElement
 Gets or sets the reference element of the geometry of the reference line (line along which the rebars are generated). It can be IdeaRS.OpenModel.Geometry3D.Segment3D or IdeaRS.OpenModel.Geometry3D.PolyLine3D or IdeaRS.OpenModel.Model.Member1D or IdeaRS.OpenModel.Model.Element1D
 (Inherited from RebarBase.)
RebarShape
 Gets or sets the geometrical shape of the rebar. IdeaRS.OpenModel.Model.RebarShape
 (Inherited from RebarBase.)
RebarType
 Rebar type
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace